namespace CloudPayments.Cash.Contracts
{
    /// <summary>
    /// see https://developers.cloudkassir.ru/#vat (old link https://cloudpayments.ru/docs/api/kassa)
    /// </summary>
    public enum VatValues
    {
        P0 = 0,     // НДС 0%  INFO: При указании ставки НДС будьте внимательны: "НДС 0%" и "НДС не облагается" — это не равнозначные варианты.
        P5 = 5,     // НДС 5%
        P7 = 7,     // НДС 7%
        P10 = 10,   // НДС 10%
        P12 = 12,   // Устарело, не используется
        P18 = 18,   // Устарело, не используется
        P20 = 20,   // НДС 20% (действует до 31 декабря 2025г)
        P22 = 22,   // НДС 22% (действует с 1 января 2026г)
        P105 = 105, // Расчетный НДС 5/105
        P107 = 107, // Расчетный НДС 7/107
        P110 = 110, // Расчетный НДС 10/110
        P118 = 118, // Устарело, не используется
        P120 = 120, // Расчетный НДС 20/120 (действует до 31 декабря 2025г)
        P122 = 122, // Расчетный НДС 22/122 (действует с 1 января 2026г)
    }
}
